Ran Plan for dir: `terragrunt/kubernetes/argocd` workspace: `terragrunt_kubernetes_argocd`

<details><summary>Show Output</summary>

```diff
Authenticated

15:14:12.542 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/5HzBchrU8o9ihaEwLwU9y69Rysg/7qQr0GDyv8fbHNFbh1T9ybKxMto
15:14:12.582 INFO   tofu: Initializing the backend...
15:14:12.873 INFO   tofu: Initializing provider plugins...
15:14:12.873 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
15:14:13.069 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
15:14:13.199 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
15:14:13.283 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
15:14:13.416 INFO   tofu: - Reusing previous version of hashicorp/random from the dependency lock file
15:14:13.511 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
15:14:13.620 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
15:14:13.757 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
15:14:13.880 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
15:14:13.999 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
15:14:14.019 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.8.1
15:14:14.053 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
15:14:14.063 INFO   tofu: - Using previously-installed hashicorp/random v3.7.2
15:14:14.135 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
15:14:14.170 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
15:14:14.201 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
15:14:14.221 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
15:14:14.235 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
15:14:14.235 INFO   tofu: OpenTofu has been successfully initialized!
15:14:15.105 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
15:14:15.105 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
15:14:15.105 STDOUT tofu:   ~ update in-place
15:14:15.105 STDOUT tofu: OpenTofu will perform the following actions:
15:14:15.105 STDOUT tofu:   # helm_release.argocd will be updated in-place
15:14:15.105 STDOUT tofu:   ~ resource "helm_release" "argocd" {
15:14:15.106 STDOUT tofu:       ~ id                         = "argocd" -> (known after apply)
15:14:15.106 STDOUT tofu:       ~ metadata                   = {
15:14:15.106 STDOUT tofu:           ~ app_version    = "v2.9.3" -> (known after apply)
15:14:15.106 STDOUT tofu:           ~ chart          = "argo-cd" -> (known after apply)
15:14:15.106 STDOUT tofu:           ~ first_deployed = 1759191041 -> (known after apply)
15:14:15.106 STDOUT tofu:           ~ last_deployed  = 1759193536 -> (known after apply)
15:14:15.106 STDOUT tofu:           ~ name           = "argocd" -> (known after apply)
15:14:15.106 STDOUT tofu:           ~ namespace      = "argocd" -> (known after apply)
15:14:15.106 STDOUT tofu:           ~ revision       = 2 -> (known after apply)
15:14:15.106 STDOUT tofu:           ~ values         = jsonencode(
15:14:15.107 STDOUT tofu:                 {
15:14:15.107 STDOUT tofu:                   - applicationSet = {
15:14:15.107 STDOUT tofu:                       - enabled  = true
15:14:15.107 STDOUT tofu:                       - replicas = 1
15:14:15.107 STDOUT tofu:                     }
15:14:15.107 STDOUT tofu:                   - configs        = {
15:14:15.107 STDOUT tofu:                       - cm     = {
15:14:15.107 STDOUT tofu:                           - "accounts.admin.enabled" = "false"
15:14:15.107 STDOUT tofu:                           - "oidc.config"            = <<-EOT
15:14:15.107 STDOUT tofu:                                 "clientId": "argocd"
15:14:15.107 STDOUT tofu:                                 "clientSecret": "$oidc-client-secret"
15:14:15.107 STDOUT tofu:                                 "issuer": "https://auth.tkasolutions.com.br/application/o/argocd/"
15:14:15.107 STDOUT tofu:                                 "name": "Authentik"
15:14:15.107 STDOUT tofu:                                 "requestedIDTokenClaims":
15:14:15.107 STDOUT tofu:                                   "groups":
15:14:15.107 STDOUT tofu:                                     "essential": true
15:14:15.107 STDOUT tofu:                                 "requestedScopes":
15:14:15.107 STDOUT tofu:                                 - "openid"
15:14:15.107 STDOUT tofu:                                 - "profile"
15:14:15.107 STDOUT tofu:                                 - "email"
15:14:15.107 STDOUT tofu:                                 - "groups"
15:14:15.107 STDOUT tofu:                             EOT
15:14:15.107 STDOUT tofu:                           - "policy.csv"             = <<-EOT
15:14:15.107 STDOUT tofu:                                 p, role:admin, applications, *, */*, allow
15:14:15.107 STDOUT tofu:                                 p, role:admin, clusters, *, *, allow
15:14:15.107 STDOUT tofu:                                 p, role:admin, repositories, *, *, allow
15:14:15.107 STDOUT tofu:                                 p, role:admin, certificates, *, *, allow
15:14:15.108 STDOUT tofu:                                 p, role:admin, accounts, *, *, allow
15:14:15.108 STDOUT tofu:                                 p, role:admin, gpgkeys, *, *, allow
15:14:15.108 STDOUT tofu:                                 p, role:admin, logs, *, *, allow
15:14:15.108 STDOUT tofu:                                 p, role:admin, exec, *, *, allow
15:14:15.108 STDOUT tofu:                                 
15:14:15.108 STDOUT tofu:                                 g, authentik Admins, role:admin
15:14:15.108 STDOUT tofu:                             EOT
15:14:15.108 STDOUT tofu:                           - "policy.default"         = "role:readonly"
15:14:15.108 STDOUT tofu:                           - url                      = "https://argocd.youhide.com.br"
15:14:15.108 STDOUT tofu:                         }
15:14:15.108 STDOUT tofu:                       - params = {
15:14:15.108 STDOUT tofu:                           - "server.insecure" = true
15:14:15.108 STDOUT tofu:                         }
15:14:15.108 STDOUT tofu:                       - secret = {
15:14:15.108 STDOUT tofu:                           - argocdServerAdminPassword      = null
15:14:15.108 STDOUT tofu:                           - argocdServerAdminPasswordMtime = null
15:14:15.108 STDOUT tofu:                           - createSecret                   = false
15:14:15.108 STDOUT tofu:                         }
15:14:15.108 STDOUT tofu:                     }
15:14:15.108 STDOUT tofu:                   - controller     = {
15:14:15.108 STDOUT tofu:                       - replicas = 1
15:14:15.108 STDOUT tofu:                     }
15:14:15.108 STDOUT tofu:                   - global         = {
15:14:15.108 STDOUT tofu:                       - domain = "argocd.youhide.com.br"
15:14:15.108 STDOUT tofu:                     }
15:14:15.108 STDOUT tofu:                   - notifications  = {
15:14:15.108 STDOUT tofu:                       - enabled = false
15:14:15.108 STDOUT tofu:                     }
15:14:15.109 STDOUT tofu:                   - redis          = {
15:14:15.109 STDOUT tofu:                       - enabled = true
15:14:15.109 STDOUT tofu:                     }
15:14:15.109 STDOUT tofu:                   - repoServer     = {
15:14:15.109 STDOUT tofu:                       - replicas = 1
15:14:15.109 STDOUT tofu:                     }
15:14:15.109 STDOUT tofu:                   - server         = {
15:14:15.109 STDOUT tofu:                       - config           = {
15:14:15.109 STDOUT tofu:                           - url = "https://argocd.youhide.com.br"
15:14:15.109 STDOUT tofu:                         }
15:14:15.109 STDOUT tofu:                       - extraArgs        = [
15:14:15.109 STDOUT tofu:                           - "--insecure",
15:14:15.109 STDOUT tofu:                         ]
15:14:15.109 STDOUT tofu:                       - extraEnvVarsFrom = [
15:14:15.109 STDOUT tofu:                           - {
15:14:15.109 STDOUT tofu:                               - secretRef = {
15:14:15.109 STDOUT tofu:                                   - name = "argocd-secret"
15:14:15.109 STDOUT tofu:                                 }
15:14:15.109 STDOUT tofu:                             },
15:14:15.109 STDOUT tofu:                         ]
15:14:15.109 STDOUT tofu:                       - ingress          = {
15:14:15.109 STDOUT tofu:                           - enabled = false
15:14:15.109 STDOUT tofu:                         }
15:14:15.109 STDOUT tofu:                       - service          = {
15:14:15.109 STDOUT tofu:                           - annotations = {
15:14:15.109 STDOUT tofu:                               - "metallb.universe.tf/loadBalancerIPs" = "192.168.220.15"
15:14:15.109 STDOUT tofu:                             }
15:14:15.109 STDOUT tofu:                           - type        = "LoadBalancer"
15:14:15.109 STDOUT tofu:                         }
15:14:15.109 STDOUT tofu:                     }
15:14:15.109 STDOUT tofu:                 }
15:14:15.109 STDOUT tofu:             ) -> (known after apply)
15:14:15.109 STDOUT tofu:           ~ version        = "5.51.6" -> (known after apply)
15:14:15.110 STDOUT tofu:         } -> (known after apply)
15:14:15.110 STDOUT tofu:         name                       = "argocd"
15:14:15.110 STDOUT tofu:       ~ values                     = [
15:14:15.110 STDOUT tofu:           - <<-EOT
15:14:15.110 STDOUT tofu:                 "applicationSet":
15:14:15.110 STDOUT tofu:                   "enabled": true
15:14:15.110 STDOUT tofu:                   "replicas": 1
15:14:15.110 STDOUT tofu:                 "configs":
15:14:15.110 STDOUT tofu:                   "cm":
15:14:15.110 STDOUT tofu:                     "accounts.admin.enabled": "false"
15:14:15.110 STDOUT tofu:                     "oidc.config": |
15:14:15.110 STDOUT tofu:                       "clientId": "argocd"
15:14:15.110 STDOUT tofu:                       "clientSecret": "$oidc-client-secret"
15:14:15.110 STDOUT tofu:                       "issuer": "https://auth.tkasolutions.com.br/application/o/argocd/"
15:14:15.110 STDOUT tofu:                       "name": "Authentik"
15:14:15.110 STDOUT tofu:                       "requestedIDTokenClaims":
15:14:15.110 STDOUT tofu:                         "groups":
15:14:15.110 STDOUT tofu:                           "essential": true
15:14:15.110 STDOUT tofu:                       "requestedScopes":
15:14:15.110 STDOUT tofu:                       - "openid"
15:14:15.110 STDOUT tofu:                       - "profile"
15:14:15.110 STDOUT tofu:                       - "email"
15:14:15.110 STDOUT tofu:                       - "groups"
15:14:15.110 STDOUT tofu:                     "policy.csv": |-
15:14:15.110 STDOUT tofu:                       p, role:admin, applications, *, */*, allow
15:14:15.110 STDOUT tofu:                       p, role:admin, clusters, *, *, allow
15:14:15.110 STDOUT tofu:                       p, role:admin, repositories, *, *, allow
15:14:15.110 STDOUT tofu:                       p, role:admin, certificates, *, *, allow
15:14:15.110 STDOUT tofu:                       p, role:admin, accounts, *, *, allow
15:14:15.110 STDOUT tofu:                       p, role:admin, gpgkeys, *, *, allow
15:14:15.111 STDOUT tofu:                       p, role:admin, logs, *, *, allow
15:14:15.111 STDOUT tofu:                       p, role:admin, exec, *, *, allow
15:14:15.111 STDOUT tofu:                 
15:14:15.111 STDOUT tofu:                       g, authentik Admins, role:admin
15:14:15.111 STDOUT tofu:                     "policy.default": "role:readonly"
15:14:15.111 STDOUT tofu:                     "url": "https://argocd.youhide.com.br"
15:14:15.111 STDOUT tofu:                   "params":
15:14:15.111 STDOUT tofu:                     "server.insecure": true
15:14:15.111 STDOUT tofu:                   "secret":
15:14:15.111 STDOUT tofu:                     "argocdServerAdminPassword": null
15:14:15.111 STDOUT tofu:                     "argocdServerAdminPasswordMtime": null
15:14:15.111 STDOUT tofu:                     "createSecret": false
15:14:15.111 STDOUT tofu:                 "controller":
15:14:15.111 STDOUT tofu:                   "replicas": 1
15:14:15.111 STDOUT tofu:                 "global":
15:14:15.111 STDOUT tofu:                   "domain": "argocd.youhide.com.br"
15:14:15.111 STDOUT tofu:                 "notifications":
15:14:15.111 STDOUT tofu:                   "enabled": false
15:14:15.111 STDOUT tofu:                 "redis":
15:14:15.111 STDOUT tofu:                   "enabled": true
15:14:15.111 STDOUT tofu:                 "repoServer":
15:14:15.111 STDOUT tofu:                   "replicas": 1
15:14:15.111 STDOUT tofu:                 "server":
15:14:15.111 STDOUT tofu:                   "config":
15:14:15.111 STDOUT tofu:                     "url": "https://argocd.youhide.com.br"
15:14:15.111 STDOUT tofu:                   "extraArgs":
15:14:15.111 STDOUT tofu:                   - "--insecure"
15:14:15.111 STDOUT tofu:                   "extraEnvVarsFrom":
15:14:15.111 STDOUT tofu:                   - "secretRef":
15:14:15.111 STDOUT tofu:                       "name": "argocd-secret"
15:14:15.111 STDOUT tofu:                   "ingress":
15:14:15.111 STDOUT tofu:                     "enabled": false
15:14:15.111 STDOUT tofu:                   "service":
15:14:15.111 STDOUT tofu:                     "annotations":
15:14:15.111 STDOUT tofu:                       "metallb.universe.tf/loadBalancerIPs": "192.168.220.15"
15:14:15.111 STDOUT tofu:                     "type": "LoadBalancer"
15:14:15.111 STDOUT tofu:             EOT,
15:14:15.111 STDOUT tofu:           + <<-EOT
15:14:15.111 STDOUT tofu:                 "applicationSet":
15:14:15.111 STDOUT tofu:                   "enabled": true
15:14:15.111 STDOUT tofu:                   "replicas": 1
15:14:15.111 STDOUT tofu:                 "configs":
15:14:15.111 STDOUT tofu:                   "cm":
15:14:15.111 STDOUT tofu:                     "accounts.admin.enabled": "false"
15:14:15.112 STDOUT tofu:                     "oidc.config": |
15:14:15.112 STDOUT tofu:                       "clientId": "argocd"
15:14:15.112 STDOUT tofu:                       "clientSecret": "$oidc-client-secret"
15:14:15.112 STDOUT tofu:                       "issuer": "https://auth.tkasolutions.com.br/application/o/argocd/"
15:14:15.112 STDOUT tofu:                       "name": "Authentik"
15:14:15.112 STDOUT tofu:                       "requestedIDTokenClaims":
15:14:15.112 STDOUT tofu:                         "groups":
15:14:15.112 STDOUT tofu:                           "essential": true
15:14:15.112 STDOUT tofu:                       "requestedScopes":
15:14:15.112 STDOUT tofu:                       - "openid"
15:14:15.112 STDOUT tofu:                       - "profile"
15:14:15.112 STDOUT tofu:                       - "email"
15:14:15.112 STDOUT tofu:                       - "groups"
15:14:15.112 STDOUT tofu:                     "policy.csv": |-
15:14:15.112 STDOUT tofu:                       p, role:admin, applications, *, */*, allow
15:14:15.112 STDOUT tofu:                       p, role:admin, clusters, *, *, allow
15:14:15.112 STDOUT tofu:                       p, role:admin, repositories, *, *, allow
15:14:15.112 STDOUT tofu:                       p, role:admin, certificates, *, *, allow
15:14:15.112 STDOUT tofu:                       p, role:admin, accounts, *, *, allow
15:14:15.112 STDOUT tofu:                       p, role:admin, gpgkeys, *, *, allow
15:14:15.112 STDOUT tofu:                       p, role:admin, logs, *, *, allow
15:14:15.112 STDOUT tofu:                       p, role:admin, exec, *, *, allow
15:14:15.112 STDOUT tofu:                 
15:14:15.112 STDOUT tofu:                       g, authentik Admins, role:admin
15:14:15.112 STDOUT tofu:                     "policy.default": "role:readonly"
15:14:15.112 STDOUT tofu:                     "url": "https://argocd.youhide.com.br"
15:14:15.112 STDOUT tofu:                   "secret":
15:14:15.112 STDOUT tofu:                     "argocdServerAdminPassword": null
15:14:15.112 STDOUT tofu:                     "argocdServerAdminPasswordMtime": null
15:14:15.112 STDOUT tofu:                     "createSecret": false
15:14:15.112 STDOUT tofu:                 "controller":
15:14:15.112 STDOUT tofu:                   "replicas": 1
15:14:15.112 STDOUT tofu:                 "global":
15:14:15.112 STDOUT tofu:                   "domain": "argocd.youhide.com.br"
15:14:15.112 STDOUT tofu:                 "notifications":
15:14:15.112 STDOUT tofu:                   "enabled": false
15:14:15.113 STDOUT tofu:                 "redis":
15:14:15.113 STDOUT tofu:                   "enabled": true
15:14:15.113 STDOUT tofu:                 "repoServer":
15:14:15.113 STDOUT tofu:                   "replicas": 1
15:14:15.113 STDOUT tofu:                 "server":
15:14:15.113 STDOUT tofu:                   "config":
15:14:15.113 STDOUT tofu:                     "url": "https://argocd.youhide.com.br"
15:14:15.113 STDOUT tofu:                   "extraEnvVarsFrom":
15:14:15.113 STDOUT tofu:                   - "secretRef":
15:14:15.113 STDOUT tofu:                       "name": "argocd-secret"
15:14:15.113 STDOUT tofu:                   "ingress":
15:14:15.113 STDOUT tofu:                     "enabled": false
15:14:15.113 STDOUT tofu:                   "service":
15:14:15.113 STDOUT tofu:                     "annotations":
15:14:15.113 STDOUT tofu:                       "metallb.universe.tf/loadBalancerIPs": "192.168.220.15"
15:14:15.113 STDOUT tofu:                     "type": "LoadBalancer"
15:14:15.113 STDOUT tofu:             EOT,
15:14:15.113 STDOUT tofu:         ]
15:14:15.113 STDOUT tofu:         # (26 unchanged attributes hidden)
15:14:15.113 STDOUT tofu:     }
15:14:15.113 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
15:14:15.113 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/argocd -w terragrunt_kubernetes_argocd
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Fargocd%252Fterragrunt_kubernetes_argocd)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/argocd -w terragrunt_kubernetes_argocd
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```